        IDENTIFICATION DIVISION.
        PROGRAM-ID. hello.
        PROCEDURE DIVISION.
        DISPLAY "Welcome to Cobol, let's Begin!".
        STOP RUN.